const ADJECTIVE_WORD_DATA_ARRAY = [
    "가냘픈", "거친", "검은", "고운", "굳은", "귀여운", "기쁜", "깨끗한", "날카로운", "너그러운", "노란", "누런", "더운", "둥근", "뛰어난", "멋진", "멋있는", "무거운", "무딘", "무서운", "반가운", "밝은", "보드라운", "보람찬", "부드러운", "붉은", "빠른", "빨간", "뽀얀", "새로운", "서툰", "섣부른", "수줍은", "슬픈", "쌀쌀맞은", "쏜살같은", "아름다운", "어두운", "어린", "여린", "예쁜", "올바른", "옳은", "외로운", "잘난", "잘빠진", "잘생긴", "재미있는", "젊은", "점잖은", "좋은", "줄기찬", "즐거운", "지혜로운", "푸른"," 파란", "한결같은", "희망찬", "힘찬", "행복한", "편안한", "짜릿한", "살맛나는", "흐뭇한", "유쾌한", "자유로운", "시원한", "다정한", "사랑스러운", "용기있는", "정있는", "매력있는", "평화로운", "고마운", "열정있는", "존경받는", "놀라운", "당황하는", "뿌듯한", "든든한", "튼튼한", "건강한", "건치의", "큰"
]

const NOUN_WORD_DATA_ARRAY = [
    "고양이",  "가시두더지",  "갈기늑대", "갈기쥐", "개", "개미핥기", "개코원숭이", "고라니", "고래", "고릴라", "고슴도치", "고양이", "고함원숭이", "곰", "가젤", "족제비", "기린", "긴팔원숭이", "나무늘보", "낙타", "날다람쥐", "날쥐", "남극물개", "너구리" , "네뿔영양", "노루", "눈토끼", "늘보곰", "늘보원숭이", "늑대", "다람쥐", "담비", "당나귀", "덤불멧돼지", "돌고래" , "돌산양", "돼지", "돼지사슴", "두더지", "딩고", "땃쥐", "로키산양",
    "마른원숭이", "마코르염소", "말", "멧돼지", "멧토끼", "물개", "물영양", "범고래", "바다사자", "바다표범", "바르바리양" , "바위너구리", "박쥐",  "반달가슴곰", "버마고양이", "범고래" , "벵골호랑이", "북극곰", "북극여우", "불곰", "불독", "비단원숭이", "비버", "사막여우", "사슴", "사자", "사향고양이", "사향노루", "산양", "산토끼",  "삵", "상괭이", "생쥐", "샴고양이" , "셰퍼드", "소", "수달", "수염고래" , "스라소니", "스컹크", "안경곰", "안경원숭이", "알파카", "양", "양털원숭이", "에스키모개", "여우", "여우청서", "여우원숭이", "염소", "영양", "오랑우탄", "오소리", "왕치타", "원숭이", "유럽들소" , "인도들소", "인도별사슴", "인도영양", "재규어", "점박이물범", "족제비", "쥐", "쥐캥거루", "진도개"
    , "참고래", "참돌고래", "청설모", "치와와", "치타", "친칠라", "침팬지",
     "캥거루", "코끼리", "코뿔소", "코알라", "코요테", "토끼", "토끼박쥐", "톰슨가젤", "티베트산양", "팬더마우스", "펭귄", "표범", "푸들", "퓨마",
    "하늘다람쥐", "하마", "향고래", "한국늑대", "한국표범", "향유고래", "호랑이", "혹등고래", "흰수염고래"
]

const createRandomNickname = () => {
    console.log("형용사 갯수", ADJECTIVE_WORD_DATA_ARRAY.length);
    console.log("명사 갯수", NOUN_WORD_DATA_ARRAY.length);

    const selectRandomItem = (dataArray: Array<string>) => {
        return dataArray[Math.round(Math.random() * dataArray.length)];
    }

    const randomAdjectiveWord = selectRandomItem(ADJECTIVE_WORD_DATA_ARRAY);
    const randomNounWord = selectRandomItem(NOUN_WORD_DATA_ARRAY);
    const randomNumber = Math.floor(Math.random() * 10000)
    
    console.log("랜덤 형용사", randomAdjectiveWord)
    console.log('랜덤 명사', randomNounWord)
    console.log('랜덤 숫자', Math.random() * 10000);

    const randomNickname = `${randomAdjectiveWord} ${randomNounWord}_${randomNumber}`

    return randomNickname
}

export default createRandomNickname;